In [1]:
# how to load cvs files in jupyter

In [74]:
import pandas as pd
import numpy as np

No header in our .csv file, we have to define it manually. Add the names parameter to your .read_csv() function:

In [75]:
mydataset = pd.read_csv("C:\\Users\\alan\\AI Project\\pandas_tutorial.csv",delimiter=';',
                        names = ['my_datetime', 'event', 'country', 'user_id', 'source', 'topic'])
# read the file from local, make sure use \\ instead of \

In [76]:
myTable = pd.DataFrame(mydataset)

In [77]:
#How to print a sample of your dataframe (e.g. first 5 rows)
#if () are blank, it will auto generate first 5 row
#using function .head
myTable.head()

           my_datetime event    country     user_id   source          topic
0  2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1  2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2  2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3  2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4  2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America

In [78]:
#the last few rows by:
# Using function .tail
myTable.tail(6)

              my_datetime event    country     user_id   source          topic
1789  2018-01-01 23:56:42  read  country_4  2458153050  AdWords           Asia
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1793  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

In [79]:
#a few random rows by 
#if not input sample size, default size is 1.
myTable.sample()

              my_datetime event    country     user_id  source   topic
1655  2018-01-01 22:25:31  read  country_7  2458152916  Reddit  Europe

In [80]:
#How to select specific columns of your DataFrame
myTable[['country', 'user_id']] #the inner brackets are for the list of the column names

        country     user_id
0     country_7  2458151261
1     country_7  2458151262
2     country_7  2458151263
3     country_7  2458151264
4     country_8  2458151265
...         ...         ...
1790  country_2  2458153051
1791  country_8  2458153052
1792  country_6  2458153053
1793  country_7  2458153054
1794  country_5  2458153055

[1795 rows x 2 columns]

In [81]:
#myTable.user_id
myTable['user_id']

0       2458151261
1       2458151262
2       2458151263
3       2458151264
4       2458151265
           ...
1790    2458153051
1791    2458153052
1792    2458153053
1793    2458153054
1794    2458153055
Name: user_id, Length: 1795, dtype: int64

In [82]:
#How to filter for specific values in your DataFrame
myTable[myTable.source == 'SEO']

              my_datetime event    country     user_id source          topic
0     2018-01-01 00:01:01  read  country_7  2458151261    SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262    SEO  South America
11    2018-01-01 00:08:57  read  country_7  2458151272    SEO      Australia
15    2018-01-01 00:11:22  read  country_7  2458151276    SEO  North America
16    2018-01-01 00:13:05  read  country_8  2458151277    SEO  North America
...                   ...   ...        ...         ...    ...            ...
1772  2018-01-01 23:45:58  read  country_7  2458153033    SEO  South America
1777  2018-01-01 23:49:52  read  country_5  2458153038    SEO  North America
1779  2018-01-01 23:51:25  read  country_4  2458153040    SEO  South America
1784  2018-01-01 23:54:03  read  country_2  2458153045    SEO  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052    SEO           Asia

[346 rows x 6 columns]

In [83]:
#STEP 1) First, it runs the syntax between the bracket frames: 
myTable.source == 'SEO'

0        True
1        True
2       False
3       False
4       False
        ...
1790    False
1791     True
1792    False
1793    False
1794    False
Name: source, Length: 1795, dtype: bool

In [84]:
#STEP 2) Then from the myTable table, it selects and prints every row where
#this value is True and it doesn’t print any row where the value is False.
myTable[myTable.source == 'SEO']

              my_datetime event    country     user_id source          topic
0     2018-01-01 00:01:01  read  country_7  2458151261    SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262    SEO  South America
11    2018-01-01 00:08:57  read  country_7  2458151272    SEO      Australia
15    2018-01-01 00:11:22  read  country_7  2458151276    SEO  North America
16    2018-01-01 00:13:05  read  country_8  2458151277    SEO  North America
...                   ...   ...        ...         ...    ...            ...
1772  2018-01-01 23:45:58  read  country_7  2458153033    SEO  South America
1777  2018-01-01 23:49:52  read  country_5  2458153038    SEO  North America
1779  2018-01-01 23:51:25  read  country_4  2458153040    SEO  South America
1784  2018-01-01 23:54:03  read  country_2  2458153045    SEO  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052    SEO           Asia

[346 rows x 6 columns]

Pandas functions can be used after each other

the .head() part first selects the first 5 rows of our data set and then the [['country', 'user_id']] part takes only the country and the user_id columns for this first 5 rows.

In [85]:
myTable.head()[['country', 'user_id']]

     country     user_id
0  country_7  2458151261
1  country_7  2458151262
2  country_7  2458151263
3  country_7  2458151264
4  country_8  2458151265

# Task 1:
Select the user_id, the country and the topic columns for the users who are from country_2.
Print the first five rows only

In [86]:
#first let's filter out all data from country_2
data = myTable[myTable.country == 'country_2']

#then we us data[[list of element]] syntax to get what we want, .head function because we want first 5 row.
data.head()[['country', 'user_id','topic']]

      country     user_id   topic
6   country_2  2458151267  Europe
13  country_2  2458151274  Europe
17  country_2  2458151278    Asia
19  country_2  2458151280    Asia
20  country_2  2458151281    Asia

# aggregation methods

pandas aggregation methods — such as count(), sum(), min(), max(), etc. — and the pandas groupby() function

In [87]:
zoo = pd.read_csv("C:\\Users\\alan\\AI Project\\zoo.csv")

In [88]:
zoo

      animal uniq_id  water_need
0   elephant   1,001         500
1   elephant    1002         600
2   elephant    1003         550
3      tiger   1,004         300
4      tiger    1005         320
5      tiger    1006         330
6      tiger   1,007         290
7      tiger    1008         310
8      zebra    1009         200
9      zebra   1,010         220
10     zebra    1011         240
11     zebra    1012         230
12     zebra   1,013         220
13     zebra    1014         100
14     zebra    1015          80
15      lion   1,016         420
16      lion    1017         600
17      lion    1018         500
18      lion   1,019         390
19  kangaroo    1020         410
20  kangaroo    1021         430
21  kangaroo   1,022         410

pandas count() The most basic aggregation method is counting.

In [89]:
zoo.count()

animal        22
uniq_id       22
water_need    22
dtype: int64

In [90]:
zoo[['animal']].count()

animal    22
dtype: int64

In [91]:
zoo.animal.count()

22

In [92]:
# sum() in pandas
zoo.water_need.sum()

7650

Pandas Data Aggregation: min() and max()

In [93]:
zoo.water_need.min()

80

In [94]:
zoo.water_need.max()

600

In [95]:
# average
zoo.water_need.mean()

347.72727272727275

In [96]:
zoo.water_need.median()

325.0

In [97]:
# we will have an error
zoo.mean()

C:\Users\alan\AppData\Local\Temp\ipykernel_6600\2080040003.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  zoo.mean()

water_need    347.727273
dtype: float64

In [98]:
# if we use .groupby function then try to find mean
zoo.groupby('animal').mean()

          water_need
animal
elephant  550.000000
kangaroo  416.666667
lion      477.500000
tiger     310.000000
zebra     184.285714

In [99]:
zoo.groupby('animal').count()

          uniq_id  water_need
animal
elephant        3           3
kangaroo        3           3
lion            4           4
tiger           5           5
zebra           7           7

In [119]:
zoo.groupby('animal')['uniq_id'].count()

animal
elephant    3
kangaroo    3
lion        4
tiger       5
zebra       7
Name: uniq_id, dtype: int64

# Task2

1.What’s the most frequent source in the article_read dataframe?

2.For the users of country_2, what was the most frequent topic and source combination? Or in other words: which topic, from which source, brought the most views from country_2?

In [103]:
#1 use groupby to group all different source, then use count() method 

myTable.groupby('source').count()

# we will find out that Reddit has most source 949, then follow by AdWords 500, then SEO 346

         my_datetime  event  country  user_id  topic
source
AdWords          500    500      500      500    500
Reddit           949    949      949      949    949
SEO              346    346      346      346    346

In [129]:
#first let's filter out all data from country_2
data = myTable[myTable.country == 'country_2']

#use .groupby to find

data.groupby('source')['topic'].count()

source
AdWords    111
Reddit     263
SEO         88
Name: topic, dtype: int64